# 投资成功
success = {'money': 20000}
# 投资失败
# 投资按钮置灰 非100的整数倍且大于100/非100的整数倍且小于100/字母/符号/负数
invalid_data_button_gray = [
    {'money': 456, 'check': '请输入10的整数倍'},
    {'money': 9, 'check': '请输入10的整数倍'},
    {'money': 'ah', 'check': '请输入10的整数倍'},
    {'money': '$%', 'check': '请输入10的整数倍'},
]
# 投资失败弹框提示 负的10的整数倍金额/0/空格/10的整数倍且小于100/投标金额大于剩余可投金额
invalid_data_pop_up = [
    {'money': -10, 'check': '请正确填写投标金额'},
    {'money': 0, 'check': '请正确填写投标金额'},
    {'money': ' ', 'check': '请正确填写投标金额'},
    {'money': 50, 'check': '投标金额必须为100的倍数'},
]
